import turtle
from random import *

window = turtle.Screen()

t = turtle.Turtle()
t.shape('turtle')
t.color('blue')
t.width(2)


def font_mail(text):
    for key, elem in enumerate(text):
        if elem in digits:
            t.penup()
            start_x, start_y = digits[elem][0]  # start_x и start_y присваиваем значения начальных координат цифры
            right_x = 50 * key  # сумма пикселей, которые являются промежутками между цифрами
            t.setpos(right_x + start_x, start_y)  # устанавливаем позицию откуда нужно начинать рисование
            t.pendown()

            for x, y in digits[elem][1:]:
                t.setpos(right_x + x, y)


digits = {'0': [(0, 0), (0, 30), (0, 60), (30, 60), (30, 30), (30, 0), (0, 0)],
          '1': [(0, 30), (30, 60), (30, 30), (30, 0)],
          '2': [(0, 60), (30, 60), (30, 30), (0, 0), (30, 0)],
          '3': [(0, 60), (30, 60), (0, 30), (30, 30), (0, 0)],
          '4': [(0, 60), (0, 30), (30, 30), (30, 60), (30, 0)],
          '5': [(30, 60), (0, 60), (0, 30), (30, 30), (30, 0), (0, 0)],
          '6': [(30, 60), (0, 30), (0, 0), (30, 0), (30, 30), (0, 30)],
          '7': [(0, 60), (30, 60), (0, 30), (0, 0)],
          '8': [(0, 0), (0, 30), (0, 60), (30, 60), (30, 30), (30, 0), (0, 0), (0, 30), (30, 30)],
          '9': [(0, 0), (30, 30), (30, 60), (0, 60), (0, 30), (30, 30)]
          }

font_mail('141700')
window.mainloop()
