###Событийно - ориентированное программирование

Mi©®o$oft - фигня.

Этапы работы типичной программы:
	а) инициализация
	б) сон
	в) событие (если больше одного, то появляется очередь событий)
	г) обработка
	д) задержка
	е) закрытие (TERMINATE)
	или 
	ё) KILL выполняется OS, если программа не отвечает
	
Δt -> min

###Диспетчеизация

import thinter
#инициализация
#главный цикл
while True:
	event = wait_for_event()
	if event == 1:
		....
	elif event == 2:
		....
	elif event == 3:
		....
	

scratch.mit.edu - сайт для обучения детей программированию
code.org - сайт для обучения программированию
Оконная штуковина (window gadget - widget)

younglinux.info -  Лаборатория линуксоида
effbot.org - сайт по Tkinter